DigiFennek/TransputerBox/MCUXpresso/transputerBox_WinUSB_cm4/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_FAN_TACHO_1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_FAN_TACHO_1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_FAN_TACHO_1_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_FAN_TACHO_1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_FAN_TACHO_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO1_1 (number 15), Fan Tacho 2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_FAN_TACHO_2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_FAN_TACHO_2_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_FAN_TACHO_2_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_FAN_TACHO_2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_FAN_TACHO_2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO0_2 (number 36), Reset
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_RESET_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_RESET_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_RESET_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_RESET_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_RESET_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PIO0_3 (number 37), Power On
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_PON_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_PON_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_PON_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_PON_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_PON_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PIO0_5 (number 39), Link Speed
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LINK_SPEED_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LINK_SPEED_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_LINK_SPEED_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_LINK_SPEED_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LINK_SPEED_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_6 (number 40), Test
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TEST_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_TEST_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_TEST_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_TEST_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_TEST_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PIO0_7 (number 41), C012 D0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_D0_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_D0_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_C012_D0_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_D0_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_C012_D0_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_8 (number 43), C012 D1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_D1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_D1_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_C012_D1_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_D1_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_C012_D1_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_9 (number 44), C012 D2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_D2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_D2_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define BOARD_C012_D2_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_D2_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_C012_D2_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_10 (number 45), C012 D3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_D3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_D3_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_C012_D3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_D3_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_C012_D3_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO0_11 (number 46), C012 D4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_D4_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_D4_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_C012_D4_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_D4_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_C012_D4_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                /* @} */

