DigiFennek/TransputerBox/MCUXpresso/transputerBox_WinUSB_cm4/board/pin_mux.h
/*! @name PIO0_12 (number 47), C012 D5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_D5_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_D5_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
#define BOARD_C012_D5_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_D5_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_C012_D5_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO0_13 (number 48), C012 D6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_D6_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_D6_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_C012_D6_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_D6_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_C012_D6_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO0_14 (number 49), C012 D7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_D7_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_D7_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_C012_D7_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_D7_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_C012_D7_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO0_18 (number 58), C012 RS0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_RS0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_RS0_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_C012_RS0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_RS0_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_C012_RS0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO0_19 (number 59), C012 RS1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_RS1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_RS1_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_C012_RS1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_RS1_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_C012_RS1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO0_20 (number 60), C012 RnotW
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_RNOTW_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_RNOTW_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_C012_RNOTW_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_RNOTW_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_C012_RNOTW_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO0_31 (number 13), Button
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BUTTON_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_BUTTON_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define BOARD_BUTTON_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_BUTTON_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_BUTTON_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO1_12 (number 51), Speaker
  @{ */
#define BOARD_SPEAKER_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SPEAKER_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_SPEAKER_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_10 (number 30), Analyse
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ANALYSE_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_ANALYSE_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_ANALYSE_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ANALYSE_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_ANALYSE_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_9 (number 29), Error
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ERROR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_ERROR_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define BOARD_ERROR_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_ERROR_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_ERROR_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PIO1_3 (number 17), LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_LED_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LED_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PIO0_0 (number 31), U18[4]/TO_MUX_P0_0-ISP_RX
  @{ */
#define BOARD_DEBUG_UART_RX_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

