DigiFennek/TransputerBox/MCUXpresso/transputerBox_WinUSB_cm4/board/pin_mux.h
/*! @name PIO0_1 (number 32), U6[4]/U22[3]/P0_1-ISP_TX
  @{ */
#define BOARD_DEBUG_UART_TX_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_22 (number 63), C012 notCS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_NOTCS_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_NOTCS_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_C012_NOTCS_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_NOTCS_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_C012_NOTCS_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO0_23 (number 1), C012 Output Int
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_OUTPUT_INT_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_OUTPUT_INT_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_C012_OUTPUT_INT_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_OUTPUT_INT_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_C012_OUTPUT_INT_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_24 (number 2), C012 Input Int
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_INPUT_INT_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_INPUT_INT_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */
#define BOARD_C012_INPUT_INT_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_INPUT_INT_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_C012_INPUT_INT_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_25 (number 3), C012 Reset
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_C012_RESET_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_C012_RESET_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define BOARD_C012_RESET_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_C012_RESET_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_C012_RESET_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO0_21 (number 61), Debug Pin
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_DEBUG_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_DEBUG_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_DEBUG_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#define IOCON_PIO_DIGITAL_EN 0x80u    /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INPFILT_OFF 0x0100u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO0_0 (number 31), U18[4]/TO_MUX_P0_0-ISP_RX
  @{ */
#define BOARD_INITPINS_CORE0_DEBUG_UART_RX_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CORE0_DEBUG_UART_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CORE0_DEBUG_UART_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO0_1 (number 32), U6[4]/U22[3]/P0_1-ISP_TX
  @{ */
#define BOARD_INITPINS_CORE0_DEBUG_UART_TX_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CORE0_DEBUG_UART_TX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CORE0_DEBUG_UART_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_Core0(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
